CHCP 936
title GIT获取最新批处理——wechat-pay
color 16
@echo off


echo;
echo;

echo 开始获取最新到本地仓库
echo 当前目录是：%cd%

echo;
echo;
echo 开始识别当前git的版本
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
git --version
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
echo;
echo;



echo;
echo 将获取远程git服务器变更情况
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
git pull
echo ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

echo;
echo 批处理执行完毕！
echo;

pause


 